Repository: bountonw/translate
Catalog: .tms/assets/__translation_memory_EGW/EGW-2409270_all.tmx
Source language: en
Languages: ium, lo, th

source: The price paid for our redemption, the infinite sacrifice of our heavenly Father in giving His Son to die for us,
ium: Zuoqc mienh maanh nzuonx nyei jaax-zinh se Tin-Dorngh Diex ceix bun Ninh nyei ndoqc Dorn siev maengc weic mbuo daic.

source: Fallen men are placed where, through connection with Christ, they may indeed become worthy of the name “sons of God.” {SC 15.1}
ium: Dorngc zuiz mienh haih kaux Giduc ziouc haih puix duqv mbuox heuc “Tin-Hungh nyei naamh nyouz.” {SC 15.1}

source: The Son of God came from heaven to make manifest the Father.
ium: Tin-Hungh nyei dorn yiem tin-dorngh njiec daaih weic bun cing Zaangc Diex.

source: Nothing less than the infinite sacrifice made by Christ in behalf of fallen man could express the Father’s love to lost humanity. {SC 14.2}
ium: Giduc nyunc siev guangc ndongc naaic camv weic tengx baamz zuiz mienh zungv saauv maiv zienz, kungx maaih naaiv nduqc nyungc hnangv haih biux mengh Tin-Hungh hnamv haic dorngc jauv nyei mienh maanh. {SC 14.2}

source: Psalm 145:15, 16. {SC 9.2}
ium: (Singx Nzung 145:15, 16.) {SC 9.2}

source: This is the character of God.
ium: se dongh Tin-Hungh nyei fiem-fingx.

source: Though all these evidences have been given, the enemy of good blinded the minds of men, so that they looked upon God with fear; they thought of Him as severe and unforgiving.
ium: Maiv gunv naaiv deix nyungc horngh zoux zorng-zengx nyei mv baac mienh zuqc Zoux Longx Nyei Win-Wangv buang jienv hnyouv. Ninh mbuo ziouc gamh nziex Tin-Hungh, gorv nziex laaic Tin-Hungh ciouv nyei yaac maiv haih guangc mienh nyei zuiz.

source: It is God who supplies the daily needs of all His creatures.
ium: Tin-Hungh yaac hnoi-hnoi ceix bun ninh mbuo qiemx zuqc nyei nyanc hopv.

source: Our Father in heaven is the source of life, of wisdom, and of joy.
ium: Mbuo nyei Tin-Dorngh Diex zoux ziangh maengc, cong-mengh, caux njien-youh, orn-lorqc nyei gorn-doqv.

source: God has bound our hearts to Him by unnumbered tokens in heaven and in earth.
ium: Tin-Hungh longc ziex nyungc za’eix yiem Tin-Dorngh yaac yiem baamh gen weic bun cing Ninh hnamv haic mbuo, zungv maiv haih saauv maiv zienz.

source: None but the Son of God could accomplish our redemption; for only He who was in the bosom of the Father could declare Him.
ium: Kungx maaih Tin-Hungh nyei Dorn hnangv haih zuoqc mbuo nzuonx, weic zuqc kungx maaih yiem Zaangc Diex nyei ga’hlen wuov dauh haih bun mbuo hiuv duqv Ninh.

source: That is, “My Father has so loved you that He even loves Me more for giving My life to redeem you.
ium: Eix leiz se, “Yie nyei Zaangc Diex hnamv meih mbuo ndongc naaic camv, Ninh cingx daaih hnamv yie jaa camv jienv faaux laaix yie siev yie ganh nyei maengc weic zuoqc meih mbuo nzuonx.

source: Through faith in the atoning sacrifice of Christ the sons of Adam may become the sons of God.
ium: Laaix kaux Ziouv Yesu fiqv zuiz weic tengx mbuo duqv caux Tin-Hungh horpc hnyouv, Aa^ndam nyei zeiv-fun haih benx Tin-Hungh nyei naamh nyouz.

source: It was to redeem us that Jesus lived and suffered and died.
ium: Yesu yiem seix zaangc zoux nyei sic weic zuoqc yie mbuo nzuonx, Ninh siouc kouv siouc naanc yaac daic weic zuoqc yie mbuo nzuonx daaih.

source: The more we study the divine character in the light of the cross,
ium: Yie mbuo gunv zaah mangc Tin-Hungh nyei fiem-fingx yiem ziepc nzaangc jaax ziux daaih nyei njang,

source: *And Thou givest them their meat in due season.*\
ium: *ziux horpc zuqc bun nyei ziangh hoc meih yaac bun nyanc hopv ninh mbuo.*\

source: He is “slow to anger, and of great kindness,” “because He delighteth in mercy.” (Jonah 4:2; Micah 7:18.) {SC 10.2}
ium: Tin-Hungh “hnyouv ndaauv haic, haaix zanc yaac a’hneiv zoux longx bun mienh,” weic zuqc Ninh “a’hneiv ziepc zuoqv nyei hnamv mienh.” (Yonaa 4:2; Mikaa 7:18.) {SC 10.2}

source: that he might reflect the love of God and share the joy of holiness. {SC 14.3}
ium: Mienh cingx daaih haih zuangv Tin-Hungh nyei hnamv yaac maaih mbuonc zipv cing-nzengc nyei njien-youh. {SC 14.3}

source: Jesus said, “Therefore doth My Father love Me, because I lay down My life, that I might take it again.” (John 10:17).
ium: Ziouv Yesu gorngv, “Zaangc Diex hnamv yie weic zuqc yie siev yie ganh nyei maengc daic. Yie siev yie nyei maengc weic aengx duqv maengc nzuonx.” (Yo^han 10:17).

source: There were whole villages where there was not a moan of sickness in any house,
ium: Maaix ziex norm laangz maiv maaih haaix dauh butv baengc yaac maiv maaih haaix dauh nyei biauv maaih njunh nyei qiex mbui,

source: “Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God.” (1 John 3:1).
ium: “Mangc gaax Tin-Hungh ndongc haaix hnamv mbuo! Ninh bun mbuo duqv mbuox heuc Tin-Hungh nyei naamh nyouz.” (1 Yo^han 3:1).

source: While He ever bore Himself with divine dignity,
ium: Ninh zoux nyei nyungc zeiv hnangv yietc laanh gueix mienh puix horpc Ninh se yiem Tin-Hungh daaih.

source: and, failing to find suitable language in which to express the greatness and tenderness of this love, he called upon the world to behold it.
ium: Mv baac ninh lorz maiv duqv waac gorngv puix duqv zuqc Tin-Hungh hnamv mienh nyei hnyouv ndongc naaiv hlo, en-zingh ndongc naaiv camv, ninh ziouc tov lungh ndiev mienh mangc. Ninh gorngv,

source: In all men He saw fallen souls whom it was His mission to save. {SC 12.1}
ium: yaac buatc dauh dauh se Ninh oix zuqc njoux nyei dorngc jauv mienh. {SC 12.1}

source: No, no!
ium: Zungv maiv zeiz!

source: His life was one of self-denial and thoughtful care for others.
ium: Ninh yiem seix zaangc siev jienv ninh ganh weic longx-longx nyei tengx mienh.

source: Yet these but imperfectly represent His love.
ium: Mv baac naaiv deix yietc zungv maiv nzoih zunh nyei biux mengh Ninh hnamv nyei jauv.

source: Jesus did not suppress one word of truth,
ium: Ziouv Yesu maiv muangh jienv yietc joux zien leiz,

source: and the fair earth, as it came from the Creator’s hand, bore no blight of decay or shadow of the curse.
ium: Ninh zeix baamh gen zueic haic, maiv maaih dorngx nqemh yaac maiv maaih zuqc houv zuqc zioux nyei dongh linh om jienv.

source: God made man perfectly holy and happy;
ium: Tin-Hungh zeix mienh maanh wuov zanc, Ninh zeix daaih cing-nzengc yaac maaih orn-lorqc.

source: He Himself has declared His infinite love and pity.
ium: Tin-Hungh ganh yaac zunh yaangh Ninh hnamv mienh yaac korv-lienh mienh zungv maiv maaih soux mouc.

source: Colossians 2:3.
ium: (Ko^lo^si 2:3.)

source: The sunshine and the rain, that gladden and refresh the earth, the hills and seas and plains, all speak to us of the Creator’s love.
ium: Mba'hnoi ziux njang, mbiungc yaac duih njiec bun lungh ndiev kuh yiem. Baamh gen maaih nyei ndau-baengh, gemh hlang caux koiv bun cing Zeix Lungh Ndau Nyei Ziouv za'gengh hnamv haic Ninh zeix daaih nyei nyungc-nyungc.

source: the lofty trees of the forest with their rich foliage of living green--
ium: Nqemh hlang nyei ndiangx nzueic haic, ndiemh maeng nyei.

source: I am endeared to My Father;
ium: Zaangc Diex ziouc hnamv yie jaa camv jienv faaux,

source: And all this that man might be uplifted from the ruin and degradation of sin
ium: Naaiv deix yietc zungv se weic tengx zuqc zuiz baaic waaic nyei baamh mienh bouh faaux hlang.

source: The Lord passed before Moses, and proclaimed, “The Lord, The Lord God, merciful and gracious, long-suffering, and abundant in goodness and truth, keeping mercy for thousands, forgiving iniquity and transgression and sin.” (Exodus 34:6, 7.)
ium: Ziouv jiex Mose nyei nza-hmien gorngv, “Ziouv, Ziouv, korv-lienh mienh, ceix en bun mienh nyei Tin-Hungh. Yie maiv qiex jiez siepv, za\’gengh hnamv haic mienh, yaac ziepc zuoqv nyei. Yie ziepc zuoqv nyei hnamv mienh taux cin-cin doic mienh. Yie guangc zoux waaic zoux orqv caux baamz zuiz nyei sic.” (Cuotv I^yipv 34:6, 7.)

source: The Sinner's Need of Christ
ium: Zuiz-mienh Qiemx Zuqc Giduc

source: This is His glory.
ium: Naaiv se Tin-Hungh nyei njang-laangc.

source: It is from the Father’s heart that the streams of divine compassion, manifest in Christ, flow out to the children of men.
ium: Yiem Zaangc Diex nyei hnyouv maaih korv-lienh mienh nyei en gan jienv Giduc liouc njiec taux maanc mienh.

source: The poorest and humblest were not afraid to approach Him.
ium: Mienh jomc mienh ndortv naanc ndongc haaix kouv yaac maiv gamh ziex lorz Ninh.

source: They had rejected Him, the Saviour, but He regarded them with pitying tenderness.
ium: Ye^lu^saa^lem Zingh nyei mienh nqemh Njoux Ziouv mv baac Ziouv Yesu corc korv-lienh ninh mbuo.

source: Through transgression the sons of man become subjects of Satan.
ium: Mienh laaix baamz zuiz ziouc zuqc Mienv nyei Hungh Saadaan gunv jienv ninh mbuo.

source: What a value this places upon man!
ium: Naaiv deix jauv bun cing mienh nyei maengc ze’gengh maaih jaax.

source: In becoming your Substitute and Surety,
ium: Yie div meih mbuo yaac zoux meih mbuo nyei Ndaam-daauh.

source: the more we see mercy, tenderness, and forgiveness blended with equity and justice,
ium: mbuo gunv bieqc hnyouv Tin-Hungh korv-lienh mienh. Ninh hnyouv suonc, yaac guangc mienh nyei zuiz. Ninh youc baengh fim nyei.

source: The lovely birds making the air vocal with their happy songs,
ium: Ndaamh lungh nyei norqc baaux kuv muangx haic nyei nzung.

source: Only He who knew the height and depth of the love of God could make it manifest.
ium: Dongh hiuv duqv Tin-Hungh maaih hnyouv hnamv mienh ndongc haaix jangv ndongc haaix ndo wuov dauh hnangv haih biux mengh bun mienh hiuv.

source: “No man hath seen God at any time; the only begotten Son, which is in the bosom of the Father, He hath declared Him.”
ium: “Maiv maaih haaix dauh buatc jiex Tin-Hungh. Kungx maaih ninh nyei ndoqc Dorn, dongh yiem Zaangc Diex nyei ga’hlen wuov dauh, bun mbuo hiuv duqv Tin-Hungh hnangv.”

source: He permitted Him to leave the bosom of His love, the adoration of the angels, to suffer shame, insult, humiliation, hatred, and death.
ium: Tin-Hungh nqoi nzuih bun Ziouv Yesu leih Ninh hnamv haic nyei Zaangc Diex caux zuangx fin-mienh fu-sux liuc leiz, weic mingh diev nyaiv, diev mienh mangc maiv faaux mueic, diev ganh zuqc baaic hmien, zuqc mienh nzorng, yaac zuqc daic.

source: Think of their marvelous adaptation to the needs and happiness, not only of man, but of all living creatures.
ium: Tin-Hungh zeix daaih nyei nyungc horngh bun mienh maaih ninh mbuo qiemx zuqc longc nyei maanc muotc, yaac tengx mienh njien-youh. Maiv zeiz mienh hnangv, mv baac Tin-Hungh bun saeng-kuv hieh zoih buangh zuqc ninh mbuo qiemx zuqc longc nyei nyungc-nyungc.

source: all testify to the tender, fatherly care of our God and to His desire to make His children happy. {SC 10.1}
ium: Naaiv deix yietc zungv zoux zorng-zengx gorngv Zaangc Diex ziux goux Ninh nyei fu’jueiv yaac oix ninh mbuo maaih njien-youh. {SC 10.1}

source: Such love is without a parallel.
ium: Maiv maaih haaix dauh hnamv mienh ndongc Tin-Hungh hnamv.

source: he was filled with adoration and reverence;
ium: Ninh ziouc haiz hnamv yaac taaih Tin-Hungh.

source: Love, mercy, and compassion were revealed in every act of His life;
ium: Ninh yiem seix zaangc zoux nyei nyungc-nyungc biux mengh Ninh hnamv mienh yaac korv-lienh mienh.

source: the delicately tinted flowers in their perfection perfuming the air,
ium: Ndau-beih nyei biangh ndomh mau yaac nzueic bungx ndaang nyei qiex buangv lomc-ndiev.

source: never gave needless pain to a sensitive soul.
ium: Se gorngv maiv maaih gorn-baengx nor, ninh yaac maiv bun hnyouv mau nyei mienh zuqc mun.

source: He was never rude, never needlessly spoke a severe word,
ium: Ninh maiv gorngv jiex maiv horpc zuqc gorngv nyei waac-ciouv.

source: It was the burden of sin, the sense of its terrible enormity, of its separation of the soul from God--it was this that broke the heart of the Son of God. {SC 13.1}
ium: Ninh ndaam baamh mienh nyei zuiz youc hlo youc hniev, ziouc nqaeqv jienv bun Ninh leih go Tin-Hungh, yaac zoux bun Tin-Hungh nyei Dorn hnyouv mun, mba’nziu mbaaix. {SC 13.1}

source: “God was in Christ, reconciling the world unto Himself.” (2 Corinthians 5:19).
ium: Hnangv yiem 2 Ko^lin^to 5:19 faan zaqv nyei gorngv, “Tin-Hungh yiem Giduc gu’nyuoz, tengx baamh mienh caux Ninh horpc hnyouv.”

source: The world, though fallen, is not all sorrow and misery.
ium: Maiv gunv baamh gen ndortv njiec aiv, mv baac maiv zeiz kungx maaih kuonx hnyouv nyei sic hnangv.

source: Nature and revelation alike testify of God’s love.
ium: Tin-Hungh zeix daaih nyei ga’naaiv caux Ging-Sou nyei waac fih hnangv nyei biux mengh Tin-Hungh za’gengh maaih hnyouv hnamv mienh.

source: In describing His earthly mission, Jesus said, The Lord “hath anointed Me to preach the gospel to the poor;
ium: Ziouv Yesu porv mengh Ninh yiem baamh gen oix zuqc zoux nyei gong gorngv, Ziouv “ginv yie daaih zunh kuv fienx mbuox mienh jomc mienh.

source: He pictured the Creator as a being who is watching with jealous eye to discern the errors and mistakes of men, that He may visit judgments upon them.
ium: Saadaan pien eix leiz gorngv Zeix Lungh Ndau Nyei Ziouv zanc-zanc zaah mangc mienh weic lorz qangx dingc zuiz haaix zanc mienh zoux dorngc.

source: #Chapter 1--God’s Love for Man
ium: #1--Tin-Hungh Hnamv Lungh Ndiev Mienh

source: “*The eyes of all wait upon Thee;*\
ium: “*Da’faanh maaih maengc nyei ga’naaiv mangc jienv meih,*\

source: Jesus, the tender, pitying Saviour, was God “manifest in the flesh.” (1 Timothy 3:16.) {SC 12.2}
ium: Yesu se korv-lienh mienh nyei Njoux Ziouv, se dongh Tin-Hungh “daaih benx yietc dauh baamh mienh bun mienh buatc.” (1 Ti^mo^tai 3:16.) {SC 12.2}

source: Matthew 11:27.
ium: (Matv^taai 11:27.)

source: by surrendering My life, by taking your liabilities, your transgressions,
ium: Yie siev yie ganh nyei maengc yaac zipv meih nyei zaeqv caux meih baamz nyei zuiz.

source: Jesus answered, “Have I been so long time with you, and yet hast thou not known Me, Philip?
ium: Ziouv Yesu ziouc dauc, “Filipv aah! Yie caux meih mbuo yiem lauh haic aqv. Meih corc maiv gaengh hiuv duqv yie fai?

source: but He uttered it always in love.
ium: mv baac gorngv zien leiz nyei ziangh hoc Ninh nyei qiex bun cing Ninh hnamv haic muangx Ninh nyei mienh.

source: Through the things of nature, and the deepest and tenderest earthly ties that human hearts can know, He has sought to reveal Himself to us.
ium: Ninh longc Ninh zeix daaih nyei ga’naaiv caux baamh mienh hnamv haic nyei biauv zong mienh weic tengx mbuo hiuv duqv Ninh.

source: Theme for the most profound meditation!
ium: Zungv corngh maiv zaaic yaac hnamv mangc maiv zienz.

source: He denounced hypocrisy, unbelief, and iniquity;
ium: Ninh daanh beih zaqc hnyouv njuotv nyei sic, maiv maaih sienx fim nyei hnyouv, caux zoux orqv zoux waaic nyei jauv;

source: Look at the wonderful and beautiful things of nature.
ium: Mangc gaax Tin-Hungh zeix daaih nyei ga'naaiv za’gengh nzueic yaac peix fuc haic.

source: and how sayest thou then, Show us the Father?”
ium: Hnangv naaiv meih weic haaix diuc gorngv, ‘Tov bun yie mbuo buatc Zaangc Diex?’”

source: Even little children were attracted to Him.
ium: Liemh fu’jueiv faix yaac hnamv Ninh.

source: His thoughts were pure, his aims holy.
ium: Ninh hnamv nyei jauv caux daav nyei za’eix youc cing-nzengc.

source: He bowed with the tenderest regard to every member of the family of God.
ium: Hnangv haaix yaac baac, Ninh longc suonc hnyouv mangc dauh dauh Tin-Hungh nyei naamh nyouz

source: He hath sent Me to heal the brokenhearted, to preach deliverance to the captives,
ium: Ninh paaiv yie daaih zunh mbuox zuqc wuonx nyei mienh ninh mbuo oix duqv bungx cuotv,

source: This wrung from His lips the anguished cry, “My God, My God, why hast Thou forsaken Me?” (Matthew 27:46.)
ium: Ninh ziouc bungx-sing bungx-qiex hnyouv mun nyei gorngv, “Yie nyei Tin-Hungh aah! Yie nyei Tin-Hungh! Meih weic haaix diuc guangc yie?” (Matv^taai 27:46.)

source: Satan led men to conceive of God as a being whose chief attribute is stern justice,--one who is a severe judge, a harsh, exacting creditor.
ium: Saadaan nduov mienh hnamv dorngc, gorngv Tin-Hungh nyei fiem-fingx hlo jiex wuov buonc se ciouv nyei dingc mienh nyei zuiz. Mienh ziouc gorv nziex laaic Tin-Hungh se ciouv haic nyei siemv zuiz jien, yaac zoux hnyouv hepc nyei zaeqv-ziouv.

source: The matchless love of God for a world that did not love Him!
ium: Tin-Hungh hnamv lungh ndiev mienh yaac maiv lamh beiv dorngx mv baac lungh ndiev mienh zungv maiv hnamv ninh!

source: for by My sacrifice, God can be just, and yet the Justifier of him who believeth in Jesus.” {SC 14.1}
ium: weic zuqc yie siev yie nyei maengc bun cing Tin-Hungh ‘baengh fim nyei, weic zuqc mienh baamz zuiz mv baac haaix dauh sienx kaux Yesu Giduc, Tin-Hungh bun wuov dauh caux ninh horpc hnyouv.’” (Lomaa 3:26) {SC 14.1}

source: The thorn and the thistle--the difficulties and trials that make his life one of toil and care--were appointed for his good as a part of the training needful in God’s plan for his uplifting from the ruin and degradation that sin has wrought.
ium: Zuiz bun baamh mienh ndortv njiec ndo nyei, Tin-Hungh ziouc longc njimv-cou njimv-muonc caux yiem seix zaangc nyei kuonx naanh weic tengx ninh mbuo hoqc hiuv dongh ninh mbuo qiemx zuqc hiuv, naaiv se ei jienv Ninh nyei za’eix mienh cingx daaih haih zuqc bouh faaux hlang.

source: He took man’s nature, that He might reach man’s wants.
ium: Ninh cuotv seix daaih zoux yietc dauh baamh mienh weic tengx duqv taux mienh qiemx zuqc nyei nyungc horngh.

source: He who was one with God has linked Himself with the children of men by ties that are never to be broken.
ium: Dongh caux Tin-Hungh yiem yaac dongh Tin-Hungh wuov dauh daaih nitv fatv baamh mienh, yietc liuz yaac caeqv maiv nqoi.

source: to set at liberty them that are bruised.”
ium: yaac bun zuqc mienh zoux doqc hoic wuov deix duqv bungx nqoi.”

source: Every soul was precious in His eyes.
ium: Ninh funx laanh laanh mienh weih jaaix.

source: He wept over Jerusalem, the city He loved,
ium: Ninh weic Ye^lu^saa^lem Zingh nzauh nyiemv, weic zuqc benx ninh hnamv haic nyei Zingh.

source: He went about doing good and healing all that were oppressed by Satan.
ium: Ninh mingh norm-norm dorngx zoux kuv sic yaac zorc longx yietc zungv zuqc Saadaan hoic nyei mienh.

source: He did not censure human weakness.
ium: Ninh maiv guaix baamh mienh mau maiv maaih qaqv nyei dorngx.

source: “Neither knoweth any man the Father, save the Son, and he to whomsoever the Son will reveal Him.”
ium: “Cuotv liuz Dorn, caux Dorn bun hiuv wuov deix, maiv maaih haaix dauh hiuv duqv Die.”

source: When one of the disciples made the request, “Show us the Father,”
ium: Maaih nzunc maaih dauh sai-gorx tov Ziouv Yesu gorngv, “Ziouv aah! Tov meih bun yie mbuo buatc Zaangc Diex oc.”

source: The Father loves us, not because of the great propitiation, but He provided the propitiation because He loves us.
ium: Zaangc Diex hnamv mbuo, maiv zeiz laaix Ziouv Yesu fiqv mbuo nyei zuiz Ninh cingx daaih hnamv, mv baac ninh paaiv Ziouv Yesu fiqv zuiz weic zuqc Ninh hnamv mbuo.

source: (Exodus 33:18, 19.)
ium: (Cuotv I^yipv 33:18, 19.)

source: There are flowers upon the thistles, and the thorns are covered with roses. {SC 9.3}
ium: Yiem lomc nyei njimv-cou yaac maaih biangh, njimv-muonc youc maaih biouv. {SC 9.3}

source: Behold Him in the wilderness, in Gethsemane, upon the cross!
ium: Mangc gaax yie mbuo nyei Njoux Ziouv yiem deic-bung-huaang, yiem Getc^se^maa^ni Huingx, yiem ziepc nzaangc jaax!

source: “The chastisement of our peace was upon Him; and with His stripes we are healed.” (Isaiah 53:5.)
ium: “Ninh zuqc dingc zuiz bun yie mbuo duqv baengh orn. Ninh zuqc mborqv faaux nziaamv bun yie mbuo duqv zorc longx.” (I^saa^yaa 53:5.)

source: and the more clearly we discern innumerable evidences of a love that is infinite and a tender pity surpassing a mother’s yearning sympathy for her wayward child. {SC 15.2}
ium: Mbuo yaac gunv mangc duqv cing taux saauv maiv zienz nyei zorng-zengx dongh biux mengh Tin-Hungh maaih hnyouv hnamv mienh yaac korv-lienh mienh zungv gauh camv zoux maa nyei mienh korv-lienh ninh dorngc jauv nyei fu’jueiv. {SC 15.2}

source: As the inspired apostle John beheld the height, the depth, the breadth of the Father’s love toward the perishing race,
ium: Singx Lingh tengx zoux gong-zoh Yo^han bieqc hnyouv taux Tin-Hungh hnamv mienh nyei hnyouv ndongc haaix hlang, ndongc haaix jangv, ndongc haaix ndo—se bieqc hnyouv Tin-Hungh hnamv haic a’lamh zuqc daic nyei mienh maanh.

source: “God so loved the world, that He gave His only-begotten Son.”
ium: “Tin-Hungh ndongc naaic hnamv lungh ndiev mienh cingx zorqv ninh nyei ndoqc Dorn ceix bun ninh mbuo.” (Yo^han 3:16.)

source: He is our Sacrifice, our Advocate, our Brother, bearing our human form before the Father’s throne, and through eternal ages one with the race He has redeemed--the Son of man.
ium: Yesu siev Ninh ganh nyei maengc daic waic div mbuo. Ninh zoux mbu’ndongx mienh, yaac zoux mbuo nyei Domh Gorx. Ninh yietc liuz yiem Tin-Hungh nyei nza’hmien maaih baamh mienh nyei sin ziouc duqv mbuox heuc Baamh Mienh nyei Dorn—bun cing Ninh daaih zoux yietc dauh dongh Ninh daaih zuoqc nzuonx nyei baamh mienh.

source: It is transgression of God’s law--the law of love--that has brought woe and death.
ium: Laaix mienh baamz Tin-Hungh nyei leiz-latc, se bun cing Tin-Hungh maaih hnyouv hnamv mienh nyei leiz-latc, daic nyei jauv caux yietc zungv zeqc naanc ziouc bieqc daaih naaiv baamh gen.

source: Children of the heavenly King! Precious promise!
ium: Mienh haih zoux Tin-Hungh nyei naamh nyouz se jaaix haic nyei ngaengc waac!

source: It is written that God cursed the ground for man’s sake. (Genesis 3:17.)
ium: Yiem Tin Deic Douh Sou 3:17 gorngv “Ndau ziouc laaix meih zoux nyei sic zuqc houv.” Mv baac, naaiv yiemc Ging-Sou haih faan daaih gorngv, “Ndau zuqc houv weic tengx meih” ei leiz se weic tengx mienh maanh.

source: There were whole villages where there was not a moan of sickness in any house, for He had passed through them and healed all their sick.
ium: Maaix ziex norm laangz maiv maaih haaix dauh butv baengc yaac maiv maaih yietc deix njunh nyei qiex mbui yiem haaix dauh nyei biauv, weic zuqc Ninh zueih mungv zueih laangz yangh jiex ninh mbuo yiem nyei dorngx yaac zorc longx ninh mbuo nyei yietc zungv baengc tongx baengc zingh.
